#!/usr/bin/php
<?php

require_once 'test.php';
require_once '../Validator.class.php';

class Tester extends Validator
{
	use test;
	function __construct() {}
	function t($x, $right) { $this->test($this->time($x), $right, $right); }
}

$v = new Tester('');

$v->t('8:00-20:00',       '08:00-20:00');
$v->t('Пн-Пт 8:15-20:00; Сб-Вс выходной', 'Mo-Fr 08:15-20:00; Sa-Su off');
$v->t('8-20',             '08:00-20:00');
$v->t('Пн-Вс 8-20',       '08:00-20:00');
$v->t('Пн-Вс 0-24',       '24/7');
$v->t('с 8 до 20',        '08:00-20:00');
$v->t('С 9 до 18:20',     '09:00-18:20');
$v->t('Вт,Ср, Чт, Пт-Сб 10-11', 'Tu-Sa 10:00-11:00');
$v->t('с 8 до 20, выходные 10-16',                '08:00-20:00; Sa-Su 10:00-16:00');
$v->t('Пн-сб с 9 до 20.45. Вскр с 9.15 до 17.45', 'Mo-Sa 09:00-20:45; Su 09:15-17:45');
$v->t('Пн и вт 10-11',    'Mo-Tu 10:00-11:00');
$v->t('10.00-22.00',      '10:00-22:00');
$v->t('Пн.10-22',         'Mo 10:00-22:00');
$v->t('круглосуточно',    '24/7');
$v->t('ПН-ЧТ с 9:00 до 16:00, ПТ с 9:00 до 15:00, . СБ, ВС - выходной.', // неразрывный пробел
		'Mo-Th 09:00-16:00; Fr 09:00-15:00; Sa-Su off');
$v->t('8-16,,, вс - выходной', '08:00-16:00; Su off');
